#### AdvancedTransparent Members

---

|  |
| --- |
| AdvancedTransparent Class   Properties   See Also |

The  AdvancedTransparent  type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property Static member | SurfaceAlbedo | The property labeled "Color" from the "AdvancedTransparent" schema. |
| Public property Static member | SurfaceAnisotropy | The property labeled "Anisotropy" from the "AdvancedTransparent" schema. |
| Public property Static member | SurfaceCutout | The property labeled "Image" from the "AdvancedTransparent" schema. |
| Public property Static member | SurfaceNdfType | The property labeled "NDF" from the "AdvancedTransparent" schema. |
| Public property Static member | SurfaceNormal | The property labeled "Image" from the "AdvancedTransparent" schema. |
| Public property Static member | SurfaceRotation | The property labeled "Rotation" from the "AdvancedTransparent" schema. |
| Public property Static member | SurfaceRoughness | The property labeled "Roughness" from the "AdvancedTransparent" schema. |
| Public property Static member | TransparentColor | The property labeled "Color" from the "AdvancedTransparent" schema. |
| Public property Static member | TransparentDistance | The property labeled "Transparent Distance" from the "AdvancedTransparent" schema. |
| Public property Static member | TransparentIor | The property labeled "IOR" from the "AdvancedTransparent" schema. |

# See Also

AdvancedTransparent Class

Autodesk.Revit.DB.Visual Namespace